{
  "architectures": [
    "Qwen3MoeForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 1,
  "decoder_sparse_step": 1,
  "eos_token_id": 2,
  "head_dim": 128,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.006,
  "intermediate_size": 16384,
  "max_position_embeddings": 4096,
  "max_window_layers": 80,
  "mlp_only_layers": [],
  "model_type": "qwen3_moe",
  "moe_intermediate_size": 2048,
  "norm_topk_prob": true,
  "num_attention_heads": 80,
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "num_hidden_layers": 80,
  "num_key_value_heads": 4,
  "output_router_logits": false,
  "rms_norm_eps": 1e-06,
  "rope_scaling": null,
  "rope_theta": 500000,
  "router_aux_loss_coef": 0.01,
  "sliding_window": null,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.55.4",
  "use_cache": false,
  "use_sliding_window": false,
  "vocab_size": 196608
}
